#include <bits/stdc++.h>
using namespace std;

// D - Lunlun Number
int main() {
    int K;
    cin >> K;

    int count = 0;
    // 以下一旦理解のための処理。つまり遅い。
    for (long long i = 1; ;i++) {
        long long x = i;
        long long digit = 0;
        while (true) {
            if (x < 10) {
                cout << i << endl;
                count++;
                break;
            }
            // cout << "(" << x << " % 10) " << x % 10 << endl;
            // cout << "(" << x << " % 100) / 10) " << ((x % 100) / 10) << endl;
            if (abs((x % 10) - ((x % 100) / 10)) <= 1) {
                x = x / 10;
            } else {
                break;
            }
            digit++;
        }
        if (count == K) {
            cout << i;
            return 0;
        }
    }
}

// 1の位 9個

/* 2の位 (3*8)+(2*1) 26個数
10
11
12
21
22
23
32
33
34
43
44
45
54
55
56
65
66
67
76
77
78
87
88
89
98
99
*/

/* 3の位 (142 - 68 = 76 + 1 == 77)
100
101
110
111
112
121
122
123
210
211
212
221
222
223
232
233
234
321
322
323
332
333
334
343
344
345
432
433
434
443
444
445
454
455
456
543
544
545
554
555
556
565
566
567
654
655
656
665
666
667
676
677
678
765
766
767
776
777
778
787
788
789
876
877
878
887
888
889
898
899
987
988
989
998
999
*/
